In [2]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'London', 'Paris']}
df = pd.DataFrame(data)

# Export the DataFrame to a CSV file
df.to_csv('my_data.csv', index=False)

In [3]:
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [5]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Product': ['Laptop', 'Mouse', 'Keyboard'],
    'Price': [1200.00, 25.50, 75.20],
    'Manufacturer': ['Dell, Inc.', 'Logitech', 'Razer']
}
df = pd.DataFrame(data)

In [6]:
df

    Product   Price Manufacturer
0    Laptop  1200.0   Dell, Inc.
1     Mouse    25.5     Logitech
2  Keyboard    75.2        Razer

In [7]:
df.to_csv('semi.csv', index=False, sep =';')